fun main(args: Array<String>) {
    var s = readLine()?.toLongOrNull()
    if (s == null) {
        println("Неправильно")
        return
    }
    fun pluralForm(s: Long): String = when {
        s < 60 -> "был(а) только что"
        s > 60 && s < 120 -> "был(а) в сети 1 минуту назад"

        s > 120 && s < 300 -> "был(а) в сети ${s / 60} минуты назад"
        s > 1320 && s < 1500 -> "был(а) в сети ${s / 60} минуты назад"
        s > 1920 && s < 2100 -> "был(а) в сети ${s / 60} минуты назад"
        s > 2520 && s < 2700 -> "был(а) в сети ${s / 60} минуты назад"
        s > 3120 && s < 3300 -> "был(а) в сети ${s / 60} минуты назад"

        s > 1260 && s < 1320 -> "был(а) в сети ${s / 60} минуту назад"
        s > 1860 && s < 1920 -> "был(а) в сети ${s / 60} минуту назад"
        s > 2460 && s < 2520 -> "был(а) в сети ${s / 60} минуту назад"
        s > 3060 && s < 3120 -> "был(а) в сети ${s / 60} минуту назад"

        s < 60 * 60 -> "был(а) в сети ${s / 60} минут назад"
        s > 3600 && s < 7200 -> "был(а) в сети ${s / 3600} час назад"
        s > 75600 && s < 79200 -> "был(а) в сети ${s / 3600} час назад"

        s > 7200 && s < 18000 -> "был(а) в сети ${s / 3600} часа назад"
        s > 79200 && s < 86400 -> "был(а) в сети ${s / 3600} часа назад"
        s < 24 * 60 * 60 -> "был(а) в сети ${s / 3600} часов назад"

        s < 48 * 60 * 60 -> "был(а) в сети вчера"
        s > 48 * 60 * 60 && s < 72 * 60 * 60 -> "был(а) в сети позавчера"
        else -> "был(а) в сети давно"
    }
    val res = pluralForm(s)
    println(res)
}